// See https://aka.ms/new-console-template for more information
//Демонстрация решения
//Напишите программу, которая на вход принимает число и выдает 
//его квадрат(число, умноженное * само на себя)

int number = int.Parse(Console.ReadLine());

int quarter = number * number;

Console.WriteLine(quarter);


